---
title: FluidTemperature
classe: Autodesk.Revit.DB.Plumbing.FluidTemperature
namespace: Autodesk.Revit.DB.Plumbing
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# FluidTemperature

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Density { get; set; }` | `fluidTemperature.Density` | Double |
| `Boolean IsValidObject { get; }` | `fluidTemperature.IsValidObject` | Boolean |
| `Double Temperature { get; set; }` | `fluidTemperature.Temperature` | Double |
| `Double Viscosity { get; set; }` | `fluidTemperature.Viscosity` | Double |
| `Void Dispose()` | `fluidTemperature.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```